/*--Задание 1
--Заполните базу данных из предыдущего домашнего задания. В ней должно быть:

--не менее 8 исполнителей;
--не менее 5 жанров;
--не менее 8 альбомов;
--не менее 15 треков;
--не менее 8 сборников.
--Внимание! Должны быть заполнены все поля каждой таблицы, в т.ч. таблицы связей (исполнителей с жанрами, исполнителей с альбомами, сборников с треками).*/


insert into music.ganre(ganre_name) --не менее 5 жанров
values ('Pop'), ('Roc'), ('Rap'), ('Jazz'), ('Electro')

insert into music.artist(artist_name) --не менее 8 исполнителей
values ('Artik & Asti'), ('Градусы'), ('Потап и Настя'), ('Кипелов'), ('Виконт'), ('Ария'), ('Баста'), ('Nooze MC'), ('Louis Armstrong'), ('Frank Sinatra'),  ('Linkin Park'), ('Depeche mode')

insert into music.ganre_artist(ganre_id, artist_id)
values (1, 1), (1, 2), (1, 3), (2, 4), (2, 5), (2, 6), (3, 7), (3, 8), (4, 9), (4, 10),  (2, 11), (5, 11), (5, 12)


insert into music.albom(albom_name, albom_year)--не менее 8 альбомов
values ('Миллениум Х', 2021), ('Номер 1', 2018), 
	   ('На твоей съёмной', 2020), ('Градус 100', 2016), 
	   ('Щит и Мяч', 2015), ('Всё пучком', 2013),
	   ('Часы Судного дня', 2021), ('Звёзды и кресты', 2017), 
	   ('Арийская Русь ', 2019), ('Не покоряйся судьбе!', 2011), 
	   ('Проклятье морей', 2018), ('Через все времена', 2014),  
	   ('Палец на отсечение', 2022), ('Рай.он', 2021),
	   ('Выход в город', 2021), ('Хипхопера: Орфей & Эвридика', 2018),
	   ('What A Wonderful World', 1967), ('Louis Armstrong', 1955),
	   ('Softly, As I Leave You', 1964), ('12 Songs of Christmas (feat. Bing Crosby & Fred Waring)', 1964),
	   ('One More Light', 2017), ('The Hunting Party)', 2014),
	   ('Spirit', 2017), ('Delta Machine)', 2013)
	   
insert into music.artist_albom(albom_id, artist_id)
values (1, 1), (2, 1), 
	   (3, 2), (4, 2), 
	   (5, 3), (6, 3), 
	   (7, 4), (8, 4), 
	   (9, 5), (10, 5),
	   (11, 6), (12, 6), 
	   (13, 7), (14, 7),
	   (15, 8), (16, 8),
	   (17, 9), (18, 9),
	   (19, 10), (20, 10),
	   (21, 11), (22, 11),
	   (23, 12), (24, 12)
	   
insert into music.track(track_name, track_time, albom_id)--не менее 15 треков
values ('Она не я', '03:34', 1), ('Истеричка', '03:37', 1), ('Мы будем вместе', '03:06', 2), ('Номер 1', '02:58', 2),
	   ('Твои волосы', '03:17', 3), ('О тебе думаю', '03:35', 3), ('Градус 100', '03:38', 4), ('Хочется', '03:00', 4),
	   ('По кругу', '03:44', 5), ('Не пара', '02:54', 5), ('Лил дождь', '04:06', 6), ('Мой Разгуляй', '04:11', 6),
	   ('Огненная дуга', '06:50' , 7), ('Часы Судного дня', '05:31', 7), ('Белый ад', '04:07', 8), ('Выше', '05:43', 8),
	   ('Валгалла', '07:17', 9), ('Бессмертный метал', '07:38', 9), ('Сделаны из стали и огня', '06:22', 10), ('Гордый король', '06:46', 10),
	   ('Гонка за славой', '04:53', 11), ('Пусть будет так', '05:14', 11), ('Точка невозврата', '05:10', 12), ('Ангелы неба', '04:48', 12), 
	   ('Моя игра', '04:30', 13), ('Выпускной (Медлячок)', '05:35', 13), ('Сансара', '06:02', 14), ('Ты была права', '01:58', 14),
	   ('Выход в город', '03:08', 15), ('Сельма Лагерлёф', '04:34', 15), ('Голос & струны (Орфей)', '03:03', 16), ('Мантра (Орфей)', '04:23', 16),
	   ('What a Wonderful World', '02:17', 17), ('Cabaret', '03:56', 17), ('Potato Head Blues', '03:45', 18), ('Keyhole Blues', '03:31', 18),
	   ('Heres To The Losers', '03:06', 19), ('Talk To Me Baby', '03:01', 19), ('Jingle Bells', '02:43', 20), ('Christmas Dreaming', '03:05', 20),
	   ('Nobody Can Save Me', '03:45', 21), ('Talking to My self', '03:51', 21), ('Until Its Gone', '03:51', 22), ('Final Masquerade)', '03:37', 22),
	   ('Going Backwards', '05:42', 23), ('Scum', '03:14', 23), ('So Much Love', '04:28', 24), ('The Worst Crime)', '03:48', 24)    
	
		   
insert into music.collection(collection_name, collection_year) --не менее 8 сборников
values ('old_music', 1990), ('RocknRoll', 2020), ('Hits', 2000), ('Rap', 2022), ('ALL music', 2021) , ('MIX', 1999), ('Music 2020', 2020),  ('Music 2021', 2021)

insert into music.track_collection(track_id, collection_id) 
values (33, 1), (34, 1), (35, 1), (36, 1), (37, 1), (38, 1), (39, 1), (40, 1), --old_music
	   (13, 2), (14, 2), (15, 2), (16, 2), (17, 2), (18, 2), (19, 2), (20, 2), (21, 2), (22, 2), (23, 2), (24, 2), (41, 2), (42, 2), (43, 2), (44, 2), -- RocknRoll
	   (1, 3), (2, 3), (4, 3), (6, 3), (7, 3), (8, 3), (45, 3), (46, 3), (47, 3), (48, 3), (27, 3), (29, 3), (31, 3), -- Hits
	   (25, 4), (26, 4), (27, 4), (28, 4), (29, 4), (30, 4), (31, 4), (32, 4), -- Rap
	   (1, 5), (3, 5), (5, 5), (7, 5), (9, 5), (11, 5), (13, 5), (15, 5), (17, 5), (19, 5), (21, 5), (23, 5), (25, 5), (27, 5), (29, 5), (31, 5), 
	   (33, 5), (35, 5), (37, 5), (39, 5), (41, 5), (43, 5), (45, 5), (47, 5), -- ALL music
	   (2, 6), (4, 6), (6, 6), (8, 6), (10, 6), (12, 6), (14, 6), (16, 6), (18, 6), (20, 6), (22, 6), (24, 6), (26, 6), (28, 6), (30, 6), (32, 6),
	   (34, 6), (36, 6), (38, 6), (40, 6), (42, 6), (44, 6), (46, 6), (48, 6), --MIX
	   (5, 7), (36, 7),  --Music 2020
	   (1, 8), (2, 8), (13, 8), (14, 8), (27, 8), (28, 8), (29, 8), (30, 8) --Music 2021


	   

	